rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
/*
Testing UiTM WiFi IoT 9/12/2022 Friday
Works with ESP32S2
Edited 28 Dec 2022
Subscribed to Blynk Plus RM30.90/month on Monday 13 Feb 2023
Connected and Disconnected logic furnished 15 Feb 2023

solving MD5 flash issue Sunday 18 June 2023 at TBS
python3 -m esptool --chip esp32 write_flash_status --non-volatile 0
python3 -m esptool --chip esp32 erase_flash 
*/
// #define ESP32S2_1  // M01
// #define ESP32S2_2  // M02
#define ESP32S2_3  // M03
// #define ESP32S2_4  // M04
// #define ESP32S2_5  // M05
// #define ESP32S2_6  // M06
// #define ESP32DEV_1 // M07
// #define ESP32DEV_2 // M08 @ water level sensing
// #define ESP32DEV_3
// #define ESP32DEV_4 // M09 missing usb port @ TBS front gate
// #define ESP32DEV_5 // M10
// #define ESP32DEV_6 // acting as M01 alongside ESP32S2_1
// #define ESP32C3_4

/*
V1 dateTime
V2 WiFi.localIP().toString()
V3 restart_ts & deep sleep info
V4 RSSI_dBm
V5 restartCounter
V6 busvoltage
V7 current_mA
V8 ssid
V9 get_rssi_state(RSSI_dBm)
V10 tempC
V11 humid
V12 json weather & jsonstring espnow
V13 not use
V14 not use
V15 disconn_ts_str & jsonstring espnow
V16 disconnection_count
V17 blynk_on_connected_ts
V18 ads_readout & water level
V19 wifiRetryCount
V20 BLYNK_WRITE R
V21 BLYNK_WRITE G
V22 BLYNK_WRITE B
V23 BLYNK_WRITE Clear RC
V24 BLYNK_WRITE Relay 1
V25 BLYNK_WRITE Relay 2
V26 BLYNK_WRITE Relay 3
V27 BLYNK_WRITE clear_disconnCounter
V28 BLYNK_WRITE clearWiFiRetry + espnow on/off
V29 default_hostname

V30 not use (going to be get_ambient_temp) GAUGE
V31 not use waterlevel GAUGE
V32 not use espnow c3-4 volt GAUGE
V33 not use espnow c3-7 volt GAUGE
V34 get_ambient_temp ----> espnow c3-4 amp GAUGE
V35 not use espnow c3-7 amp GAUGE
V36 not use espnow c3-4 moisture GAUGE
V37 not use espnow c3-7 moisture GAUGE
V38 not use espnow c3-4 soil temp GAUGE
V39 not use espnow c3-7 soil temp GAUGE

V40 Button LED Backlight
V41 Button Deep Sleep
V42 Button Display espnow
*/

bool deep_sleep_activated = false;
// deep sleep config
#define uS_TO_S_FACTOR 1000000ULL  /* Conversion factor for micro seconds to seconds */
#define SLEEP_HOUR     14
#define TIME_TO_SLEEP  SLEEP_HOUR*3600       /* Time ESP32 will go to sleep (in seconds) 50400 */
int setSleepHour = 18;
int setSleepMin = 0;
uint8_t etaHour = 0;
uint8_t etaMin = 0;
uint8_t etaSec = 0;
String etaDS = "HH:MM:SS";
RTC_DATA_ATTR int bootCount = 0;

// #define REGULAR_I2C_LCD // comment if using GROVE_LCD

#define LOCATION_MKE2_UiTM_WiFi_IoT // comment this line for TBS deployment
// #define LOCATION_MKE2_MaxisONE // comment this line for TBS deployment

/* Comment this out to disable prints and save space */
#define BLYNK_PRINT Serial
#define BLYNK_TEMPLATE_ID   "TMPLjsD8y_SC" // template ID for M04 and M05 then subcribing to Plus RM30.90 13Feb2023
#define BLYNK_TEMPLATE_NAME "AASAS UiTM WiFi IoT"

#if defined ESP32S2_1 || defined ESP32DEV_6
  #define BLYNK_DEVICE_NAME "AASAS M01"
  #define BLYNK_AUTH_TOKEN "J3DXwnJNxoCIUI3TF7ULHmCKdDg27FV4"
#elif defined ESP32S2_2
  #define BLYNK_DEVICE_NAME "AASAS M02"
  #define BLYNK_AUTH_TOKEN "AgRl8rHXRFkz4KnUvFWfQtlUCGZ6g8ug"
#elif defined ESP32S2_3
  #define BLYNK_DEVICE_NAME "AASAS M03"
  #define BLYNK_AUTH_TOKEN "vdnuDWozgCa3oP3_xXnekRTLmlo2mjuk"
#elif defined ESP32S2_4
  #define BLYNK_DEVICE_NAME "AASAS M04"
  #define BLYNK_AUTH_TOKEN "gee5lkJxSCmQrqplsAiH-uVPuNkF-B3G"
#elif defined ESP32S2_5
  #define BLYNK_DEVICE_NAME "AASAS M05"
  #define BLYNK_AUTH_TOKEN "Rq548So3QmWpZIJyAt59TVmW8W4GGlUd"
#elif defined ESP32S2_6
  #define BLYNK_DEVICE_NAME "AASAS M06"
  #define BLYNK_AUTH_TOKEN "qtER7nxNJH1QioLqmH_rE688VdJ5i0L0"
#elif defined ESP32DEV_1
  #define BLYNK_DEVICE_NAME "AASAS M07"
  #define BLYNK_AUTH_TOKEN "K-NDkXmOkZNC3TIKZo6EOrqdQQ8-Mr_f"
#elif defined ESP32DEV_2
  #define BLYNK_DEVICE_NAME "AASAS M08"
  #define BLYNK_AUTH_TOKEN "VoVZgVSmyKThZyh8KSS9oNq7gEcPLk0b"
#elif defined ESP32DEV_4
  #define BLYNK_DEVICE_NAME "AASAS M09"
  #define BLYNK_AUTH_TOKEN "ZELuVGWY16O3KPW8mLkgkdISj2ohVgP7"
#elif defined ESP32DEV_5
  #define BLYNK_DEVICE_NAME "AASAS M10"
  #define BLYNK_AUTH_TOKEN "Wo6dEX9FFGRjR-fbRShY-FxM9uYAYdqp"
#endif

#include "GroveBase-ESPDuino32-Mapping.h"
#include <esp_now.h>
#include <Wire.h>
#include<ADS1115_WE.h> 
#include "rgb_lcd.h"
#include <LiquidCrystal_I2C.h>

#include <WiFi.h>
#include <WiFiClient.h>
#include <BlynkSimpleEsp32.h>
#include "uptime_formatter.h"
#include "uptime.h"
#include "EEPROM.h"

#include <Adafruit_NeoPixel.h>
#include <Adafruit_INA219.h>

#include <NTPClient.h>
#include <WiFiUdp.h>
#include <HTTPClient.h>
#include <Arduino_JSON.h>
#include "DS1307.h"
#include <ChainableLED.h>

TaskHandle_t Task1; // ESPNOW
TaskHandle_t Task2; // BLYNK

// MAC Address of the receiver #1 => 9c:9c:1f:c5:94:24 (ESP01-client-1)
uint8_t client1_mac[] = {0x9C, 0x9C, 0x1F, 0xC5, 0x94, 0x24};
String client1_mac_string = "9c:9c:1f:c5:94:24"; // must be lowercase 27.08.2022 Sat
const char* client1_cchar = client1_mac_string.c_str();

// MAC Address of the receiver #2 => 9c:9c:1f:e3:85:3c (ESP01-client-2)
uint8_t client2_mac[] = {0x9C, 0x9C, 0x1F, 0xE3, 0x85, 0x3C};
String client2_mac_string = "9c:9c:1f:e3:85:3c"; // must be lowercase 27.08.2022 Sat
const char* client2_cchar = client2_mac_string.c_str();

// MAC Address of the receiver #3  7C:DF:A1:AF:AA:B4 (ESP32-C3 26.08.2022)
// 7C:DF:A1:AF:AB:00 (changed 9 June 2023 after crosscheck)
uint8_t client3_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAB, 0x00};
String client3_mac_string = "7c:df:a1:af:ab:00"; // must be lowercase 27.08.2022 Sat
const char* client3_cchar = client3_mac_string.c_str();

// 7C:DF:A1:AF:AD:24 (C3-4) added 10.06.2023 saturday after SKJMT IBIZ
uint8_t client4_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAD, 0x24};
String client4_mac_string = "7c:df:a1:af:ad:24"; // new C3-74 added 9.june.2023
const char* client4_cchar = client4_mac_string.c_str();

// 7C:DF:A1:AF:AC:B8 (C3-6)
uint8_t client6_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAC, 0xB8}; // MAC not confirmed 10.june.2023
String client6_mac_string = "7c:df:a1:af:ac:b8"; // MAC not confirmed 10.june.2023
const char* client6_cchar = client6_mac_string.c_str(); // changed 10.june.2023 after SKJMT


