rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
// 7C:DF:A1:AF:A8:D8(C3-7)
uint8_t client7_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xA8, 0xD8}; // MAC not confirmed 10.june.2023
String client7_mac_string = "7c:df:a1:af:a8:d8"; // MAC not confirmed 10.june.2023
const char* client7_cchar = client7_mac_string.c_str(); // changed 10.june.2023 after SKJMT


//7C:DF:A1:AF:AD:20 (C3-8)
uint8_t client8_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAD, 0x20}; // changed 10.june.2023 after SKJMT
String client8_mac_string = "7c:df:a1:af:ad:20"; // new C3-7 added 9.june.2023
const char* client8_cchar = client8_mac_string.c_str(); // changed 10.june.2023 after SKJMT

// Structure example to receive data
// Must EXACTLY MATCH THE PATTERN of the sender's structure
typedef struct struct_message {
  String id;
  unsigned int readingId;
  float volt;
  float amps;
  float temp;
  float humi;
  float mois;
  float rain;
} struct_message;

struct_message incomingReadings;

//Structure example to send data
//Must match the receiver structure (client-1 and client-2)
typedef struct struct_control {
    int control;
} struct_control;


//Create a struct_message called sendControl
struct_control sendControl;
JSONVar     board;

bool esp_now_initialized = false;
#define CORE_0      0x00
#define CORE_1      0x01

bool displayESPNOW = false;
String jsonString1 = "None";
String dt1 = "None";
float temp1 = 0;
float humi1 = 0;
float moist1 = 0;
float rain1 = 0;
float volt1 = 0;
float amps1 = 0;
uint16_t read_id1 = 0;
uint16_t prev_read_id1 = 0;

String jsonString2 = "None";
String dt2 = "None";
float temp2 = 0;
float humi2 = 0;
float moist2 = 0;
float rain2 = 0;
float volt2 = 0;
float amps2 = 0;
uint16_t read_id2 = 0;
uint16_t prev_read_id2 = 0;

String jsonString3 = "None";
String dt3 = "None";
float temp3 = 0;
float humi3 = 0;
float moist3 = 0;
float rain3 = 0;
float volt3 = 0;
float amps3 = 0;
uint16_t read_id3 = 0;
uint16_t prev_read_id3 = 0;

String jsonString4 = "None";
String dt4 = "None";
float temp4 = 0;
float humi4 = 0;
float moist4 = 0;
float rain4 = 0;
float volt4 = 0;
float amps4 = 0;
uint16_t read_id4 = 0;
uint16_t prev_read_id4 = 0;

String jsonString6 = "None";
String dt6 = "None";
float temp6 = 0;
float humi6 = 0;
float moist6 = 0;
float rain6 = 0;
float volt6 = 0;
float amps6 = 0;
uint16_t read_id6 = 0;
uint16_t prev_read_id6 = 0;

String jsonString7 = "None";
String dt7 = "None";
float temp7 = 0;
float humi7 = 0;
float moist7 = 0;
float rain7 = 0;
float volt7 = 0;
float amps7 = 0;
uint16_t read_id7 = 0;
uint16_t prev_read_id7 = 0;

String jsonString8 = "None";
String dt8 = "None";
float temp8 = 0;
float humi8 = 0;
float moist8 = 0;
float rain8 = 0;
float volt8 = 0;
float amps8 = 0;
uint16_t read_id8 = 0;
uint16_t prev_read_id8 = 0;

#define RGB         18 
#define NUMPIXELS   1 
#define DELAYVAL    100 

#if defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)     
  #define IN1         GROVE_D2
  #define IN2         GROVE_D3
  #define IN3         GROVE_D4
  #define LED_BLUE    GROVE_D5
  #define NUM_LEDS    1
  ChainableLED        leds(GROVE_A0, GROVE_A1, NUM_LEDS); // (LEAVE A1 EMPTY)
  byte                i = 0; // CHAINABLE LED ARRAY
  const int trig_pin = GROVE_D6; // D7 default
  const int echo_pin = GROVE_D7; // D6 default
  #define BLINKER     GROVE_D13
#else
  #define IN1         19
  #define IN2         20
  #define IN3         21
  #define LED_BLUE    26  // assumption IO26 on ESP32S2
  #define NUM_LEDS     1
  ChainableLED        leds(35, 36, NUM_LEDS); // (LEAVE A1 EMPTY) Dummy 35,36 on ESP32S2
  byte                i = 0; // CHAINABLE LED ARRAY
  const int trig_pin = 33; // Dummy 33 on ESP32S2
  const int echo_pin = 34; // Dummy 34 on ESP32S2
  #define BLINKER     37 // Dummy

#endif

#ifdef ESP32C3
  #define ONBOARD_LED 18
  #define R 3
  #define G 4
  #define B 5
#else
  #define ONBOARD_LED 2
#endif

// #include <math.h>


// Sound speed in air
#define SOUND_SPEED 340
#define TRIG_PULSE_DURATION_US 10
long ultrason_duration;
float distance_cm;
int waterLvlPercent;

const int B = 4275;               // B value of the thermistor
const int R0 = 100000;            // R0 = 100k
#if defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)       
const int pinTempSensor = GROVE_A3;
#else
const int pinTempSensor = 1;     // Grove - Temperature Sensor connect to IO0
#endif


char auth[] = BLYNK_AUTH_TOKEN;

#ifdef LOCATION_MKE2_UiTM_WiFi_IoT
  char ssid[] = "UiTM WiFi IoT";
  char pass[] = ""; // leave this empty as this is an open network
#elif defined LOCATION_MKE2_MaxisONE
  char ssid[] = "MaxisONE Fibre 2.4G_EXT";
  char pass[] = "respironics"; // leave this empty as this is an open network
#else
  char ssid[] = "MaxisONE Fibre 2.4G_EXT"; // TP-link extender / DEV-4 doesnt need EXT
  char pass[] = "respironics"; // leave this empty as this is an open network
#endif

String ssidstr = "None";
// char ssid[] = "Robotronix MKE2";
// char pass[] = "robotronix"; // leave this empty as this is an open network

// char ssid[] = "Maxis Postpaid 128";
// char pass[] = "respironics"; // leave this empty as this is an open network

#ifdef ESP32C3_4 || defined (ESP32C3_6) || defined (ESP32C3_8)
  #define I2C_SDA                 8 
  #define I2C_SCL                 9
#elif defined ESP32DEV_1 || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)      
  // use default i2c pinoutx2
#else
  #define I2C_SDA                 41 
  #define I2C_SCL                 40
#endif

#define wifiConnRetryAddress    0x0C // 12 & 13 : 2 bytes 
#define restartCounterAddress   0x0F // 15 & 16 : 2 bytes F 10 11
#define disconnCounterAddress   0x12 // 18 & 19 bytes
#define disconnectTS__Address   0x14 // 21 and beyond 
#define ADS_I2C_ADDRESS         0x48

WiFiUDP             ntpUDP;
NTPClient           timeClient(ntpUDP);
BlynkTimer          timer;
Adafruit_NeoPixel   pixels(NUMPIXELS, RGB);
Adafruit_INA219     ina219_A;
ADS1115_WE          adc = ADS1115_WE(ADS_I2C_ADDRESS);
DS1307              _clock;
// comment either one of this
#ifdef REGULAR_I2C_LCD
  LiquidCrystal_I2C   lcd(0x27,16,2);  // set the LCD address to 0x27 for a 16 chars and 2 line display
#else
  rgb_lcd             lcd;
#endif

// Variables to save date and time
String formattedDate;
String dayStamp;
String timeStamp;
String restart_ts = "None";
String disconnected_ts = "None";
String hostname = BLYNK_DEVICE_NAME;
String default_hostname = "None";

float shuntvoltage;
float busvoltage;
float current_mA;

bool I2C_LCD_AVAILABLE = false;
bool GROVE_LCD_AVAILABLE = false; // true for debugging purpose 27.02.2023 | change to false 03.03.2023
bool INA219_AVAILABLE = false;
bool ADS1115_AVAILABLE = false;

