rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
#define EEPROM_SIZE             48
#define FAST_DELAY              1000

int restartCounter;      // value will be loaded from EEPROM
int disconnection_count; // value will be loaded from EEPROM
int wifiRetryCount = -1 ; // value will be loaded from EEPROM

byte tick = 0;
byte red, green, blue;

byte degree_symbol[8] = {
    0b00110,
    0b01001,
    0b01001,
    0b00110,
    0b00000,
    0b00000,
    0b00000,
    0b00000,
  };
    byte right_arrow[8] = {
    0b10000,
    0b11000,
    0b11100,
    0b11110,
    0b11111,
    0b11110,
    0b11100,
    0b11000,
  };
    byte wave_right[8] = {
    0b11000,
    0b11100,
    0b01110,
    0b00111,
    0b00111,
    0b01110,
    0b11100,
    0b11000,
  };

  byte wave_left[8] = {
    0b00011,
    0b00111,
    0b01110,
    0b11100,
    0b11100,
    0b01110,
    0b00111,
    0b00011,
  };

BLYNK_CONNECTED();
BLYNK_DISCONNECTED();
BLYNK_RESTART();

BLYNK_WRITE(V20);
BLYNK_WRITE(V21);
BLYNK_WRITE(V22);
BLYNK_WRITE(V23);
BLYNK_WRITE(V24);
BLYNK_WRITE(V25);
BLYNK_WRITE(V26);
BLYNK_WRITE(V27);

void BLYNK_TASK();
void i2c_scan();
void initINA219();
void init_eeprom();
void off_onboard_led();
void on_onboard_led();
void loopRGB();
void redOn();
void greenOn();
void blueOn();
void rgbOff();
void check_restart_count();

void clear_restartCounter();
void clear_disconnCounter();
void try_wifi_connect(int timeout);

void onRelay1();
void onRelay2(); // borrow this function to turn on/off i2c LCD LED backlight 
void onRelay3();
void offRelay1();
void offRelay2();
void offRelay3();
String get_timestamp();

bool openNetwork = false;

String openWeatherMapApiKey = "dbd7235bcc77e5896c73e975d013debe";
String city = "Kuching";
String countryCode = "MY";
unsigned long lastTime = 0;
unsigned long interval = 2000;

String jsonBuffer   = "None";
String jsonString   = "None";
String jsonHumid    = "None";
String jsonWeather  = "None";

float tempK ; 
float tempC ;
float humid ; 

String mac_str = "UNKNOWN MAC";
String esp_model = "UNKNOWN ESP";

void setup()
{
  Serial.begin(115200);
  #if defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)      
    Wire.begin();
  #else
    Wire.begin(I2C_SDA, I2C_SCL);
  #endif
  mac_str = WiFi.macAddress();
  const char* mac_addr = mac_str.c_str();
  Serial.print("MAC (String):");
  Serial.println(mac_str);
  Serial.printf("MAC (const char): %s\n", mac_addr);

  //Increment boot number and print it every reboot
  ++bootCount;
  Serial.println("Boot number: " + String(bootCount));
  //Print the wakeup reason for ESP32
  print_wakeup_reason();

  Serial.print("\n\n **************DEEP SLEEP CONFIG********************* \n");
  esp_sleep_enable_timer_wakeup(TIME_TO_SLEEP * uS_TO_S_FACTOR);
  Serial.println("Setup ESP32 to sleep for every " + String(TIME_TO_SLEEP) +
  " Seconds or " + String(SLEEP_HOUR) + " Hours");
  Serial.println("Start Deep Sleep at " + String(setSleepHour) + ":" + String(setSleepMin));
  Serial.print("\n ****************************************************** \n\n");

  if(strcmp(mac_addr,"7C:DF:A1:AF:AA:B4")==0) esp_model = "ESP32C3-1";
  if(strcmp(mac_addr,"7C:DF:A1:AF:AC:FC")==0) esp_model = "ESP32C3-2";
  if(strcmp(mac_addr,"7C:DF:A1:AF:AB:00")==0) esp_model = "ESP32C3-3";
  if(strcmp(mac_addr,"7C:DF:A1:AF:AD:24")==0) esp_model = "ESP32C3-4"; // aziz
  if(strcmp(mac_addr,"7C:DF:A1:AF:AB:C0")==0) esp_model = "ESP32C3-5"; // aziz

  if(strcmp(mac_addr,"7C:DF:A1:00:72:C6")==0) esp_model = "ESP32S2-1";
  if(strcmp(mac_addr,"7C:DF:A1:00:BB:7C")==0) esp_model = "ESP32S2-2";
  if(strcmp(mac_addr,"7C:DF:A1:00:BA:9E")==0) esp_model = "ESP32S2-3";
  if(strcmp(mac_addr,"7C:DF:A1:00:6D:AA")==0) esp_model = "ESP32S2-4";
  if(strcmp(mac_addr,"7C:DF:A1:00:8D:74")==0) esp_model = "ESP32S2-5";
  if(strcmp(mac_addr,"7C:DF:A1:00:BA:BE")==0) esp_model = "ESP32S2-6";
  if(strcmp(mac_addr,"7C:DF:A1:00:A7:0C")==0) esp_model = "ESP32S2-7";
  if(strcmp(mac_addr,"7C:DF:A1:00:A7:38")==0) esp_model = "ESP32S2-8";

  if(strcmp(mac_addr,"C8:2B:96:B9:A9:58")==0) esp_model = "ESP32DEV-1";
  if(strcmp(mac_addr,"9C:9C:1F:E3:85:3C")==0) esp_model = "ESP32DEV-2";
  if(strcmp(mac_addr,"84:CC:A8:5E:6E:E8")==0) esp_model = "ESP32DEV-3";
  // 7C:9E:BD:07:A8:E4 (Dev-4 with broken usb port)
  if(strcmp(mac_addr,"7C:9E:BD:07:A8:E4")==0) esp_model = "ESP32DEV-4"; // 9C:9C:1F:C5:94:24 who is this?
  if(strcmp(mac_addr,"84:0D:8E:E2:D6:D8")==0) esp_model = "ESP32DEV-5";
  if(strcmp(mac_addr,"9C:9C:1F:C5:94:24")==0) esp_model = "ESP32DEV-6"; // added 19 Jun 2023


  Serial.printf("[setup] %s Found!\n",esp_model);
  Serial.printf("[setup] MAC: %s\n", mac_addr);
  mac_str.remove(2,1); // remove the first : from MAC 

  Serial.println("\nScanning ESP32s2 i2c port...");
  i2c_scan(); // this method discovered to be failed after the latest ESP32 core update 24.02.2023 (Friday)
  Serial.println("\nReinit i2c port");
  #if defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)        
    Wire.begin();
  #else
    Wire.begin(I2C_SDA, I2C_SCL);
  #endif  
  Wire.setClock(125000); // discovered 27.02.2023 at Berlian | this is the key line to solve the weird i2c scanning issue 03.03.2023
  
  if(INA219_AVAILABLE){
    initINA219();
  }

  #ifdef REGULAR_I2C_LCD
    lcd.init();                      
    lcd.backlight();
  #else
    lcd.begin(16, 2); // GROVE_LCD_AVAILABLE
  #endif

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.createChar(1, wave_right); // create block character
    lcd.createChar(2, wave_left); // create block character
    lcd.createChar(3, right_arrow); // create block character
    lcd.createChar(4, degree_symbol); // create block character
    lcd.setCursor(0,0);
    lcd.print(esp_model);
    lcd.setCursor(0,1);
    lcd.print(mac_str);
    delay(2000);
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Hello "+ String(BLYNK_DEVICE_NAME));
    lcd.setCursor(0,1);
    lcd.print("Connecting WiFi");
    delay(1000);
    lcd.clear();
  }  

  if(ADS1115_AVAILABLE){
    if(!adc.init()){
      Serial.println("ADS1115 not connected!");
    }
    adc.setVoltageRange_mV(ADS1115_RANGE_4096); //comment line/change parameter to change range
  }
  
  init_eeprom();
  // write16bitIntoEEPROM(wifiConnRetryAddress, 0); // comment this after debugging || the first upload

  // restartCounter = EEPROM.read(restartCounterAddress);
  restartCounter = read16bitFromEEPROM(restartCounterAddress);
  disconnection_count = read16bitFromEEPROM(disconnCounterAddress);
  wifiRetryCount = read16bitFromEEPROM(wifiConnRetryAddress);
  if(wifiRetryCount > 65535) wifiRetryCount = 0;
  check_restart_count();

  pinMode(ONBOARD_LED, OUTPUT);
  pinMode(IN1, OUTPUT);
  pinMode(IN2, OUTPUT);
  pinMode(IN3, OUTPUT);
  pinMode(LED_BLUE, OUTPUT);
  pinMode(trig_pin, OUTPUT); // We configure the trig as output
  pinMode(echo_pin, INPUT); // We configure the echo as input
  pinMode(BLINKER,OUTPUT); // blinker at solar panel

  #ifdef ESP32C3
    pinMode(R,OUTPUT);
    pinMode(G,OUTPUT);
    pinMode(B,OUTPUT);
  #endif
  off_onboard_led();
  delay(1000);

  // WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);
  // Serial.print("ESP32 hostname before calling setting WiFi_STA: ");
  // Serial.println(default_hostname);   /*New Hostname printed*/ 

  WiFi.mode(WIFI_STA); //Optional
  default_hostname = WiFi.getHostname();

