rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
  // WiFi.setHostname(hostname.c_str());
  // Serial.print("ESP32 hostname after changing hostname: ");
  Serial.print("ESP32 hostname after calling setting WiFi_STA: ");
  Serial.println(default_hostname);   /*New Hostname printed*/ 

  ssidstr = String(ssid);
  if(ssidstr.length() > 16)
    ssidstr.remove(0,ssidstr.length()-16); // logic corrected at MKE2 18:58 Wed 21 June

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    try_wifi_connect(10); // pre-connection using WiFi.begin() with 10 second default timeout
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Connecting Blynk");
    lcd.setCursor(0,1);
    lcd.write(1); // add arrow before SSID
    lcd.print(ssid);
  }

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Init TimeClient!");
    lcd.setCursor(0,1);
    lcd.print("-Get restart ts!");
  }
  // 30 Dec 2022 Friday | Polished 10 Feb 2023 Friday
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Adapters/BlynkArduinoClient.h (to fix connecting to blynk.cloud:80 infinite loop)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Blynk/BlynkProtocol.h (to edit logo)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/BlynkSimpleEsp32.h (to edit Blynk.begin method)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Blynk/BlynkHandlers.h (BLYNK define methods)
  Serial.print("ESP32 NEW HOSTNAME: ");
  Serial.println(default_hostname);   /*New Hostname printed*/ 
  
  timeClient.begin();
  timeClient.setTimeOffset(28800);
  restart_ts = get_timestamp(); // must be called after timeClient.begin() for the restart timestamp
  restart_ts = get_timestamp(); // second call to reconfirm

  byte setH=0,setM=0,setS=0;
  short int setYear=2023; 
  byte setMonth=1, setDay=1;

  setH = timeClient.getHours();
  setM = timeClient.getMinutes();
  setS = timeClient.getSeconds();

  formattedDate   = timeClient.getFormattedDate(); 
  int splitT      = formattedDate.indexOf("T");
  String date_only = formattedDate.substring(4, splitT);
  Serial.println(date_only);


  _clock.begin();
  _clock.fillByYMD(setYear,setMonth,setDay);
  _clock.fillByHMS(setH,setM,setS);
  _clock.fillDayOfWeek(WED);
  _clock.setTime(); // write time and date to the RTC chip

  Blynk.begin(auth, ssid, pass); // connectWiFi in Blynk is active. meaning connecting twice

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Blynk Connected!");
    lcd.setCursor(0,1);
    lcd.print("-"+String(BLYNK_DEVICE_NAME)+" INIT-");
  }
  on_onboard_led();
  pixels.begin(); 
  loopRGB();
  rgbOff();
 

  xTaskCreatePinnedToCore(
      BLYNK_HandlerTask,        /* Task function. */
      "BLYNK",                  /* name of task. */
      10000,                    /* Stack size of task */
      NULL,                     /* parameter of the task */
      1,                        /* priority of the task */
      &Task2,                   /* Task handle to keep track of created task */
      
      CORE_0);                  /* pin task to core 0 */     
  delay(500); 

  xTaskCreatePinnedToCore(
      ESPNOW_HandlerTask,       /* Task function. */
      "ESPNOW",                 /* name of task. */
      10000,                    /* Stack size of task */
      NULL,                     /* parameter of the task */
      1,                        /* priority of the task */
      &Task1,                   /* Task handle to keep track of created task */
      CORE_1);                  /* pin task to core 1 */                  
  delay(500); 


} // end of setup


void loop()
{
  // Blynk.run();
  // timer.run();
}


// callback when data is sent
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  Serial.print("\r\nLast Packet Send Status:\t");
  Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
}


// callback function that will be executed when data is received
void OnDataRecv(const uint8_t * mac_addr, const uint8_t *incomingData, int len) { 

  // Copies the sender mac address to a string
  char macStr[18];
  Serial.print("Packet received from: ");
  snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
           mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
  // Serial.println(macStr); // UNCOMMENT THIS TO FIGURE OUT THE CLIENT'S MAC 27.08.2022
  if(strcmp(macStr, client1_cchar) == 0)      
  {
    Serial.println("Client ID 1");
  }
  if(strcmp(macStr, client2_cchar) == 0) 
  {
    Serial.println("Client ID 2");
  }
  if(strcmp(macStr, client3_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-3");
  }
  if(strcmp(macStr, client4_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-4");
  }
  // if(strcmp(macStr, client5_cchar) == 0) 
  // {
  //   Serial.println("Client ESP32C3-5");
  // }
  if(strcmp(macStr, client6_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-6");
  }
  if(strcmp(macStr, client7_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-7");
  }
  if(strcmp(macStr, client8_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-8");
  }
  // Serial.println("Unknown Client! Check client's MAC");


  memcpy(&incomingReadings, incomingData, sizeof(incomingReadings));

  // must use double quote for the json label 27.08.2022
  board["d"] = incomingReadings.id; 
  board["#"] = String(incomingReadings.readingId);
  board["v"] = incomingReadings.volt; 
  board["a"] = incomingReadings.amps;  
  board["t"] = incomingReadings.temp; 
  board["h"] = incomingReadings.humi; 
  board["m"] = incomingReadings.mois; 
  board["r"] = incomingReadings.rain; 


  if(incomingReadings.id == "ESP32C3-1"){
    temp1 = incomingReadings.temp;
    humi1 = incomingReadings.humi;
    moist1 = incomingReadings.mois;
    rain1 = incomingReadings.rain;
    volt1 = incomingReadings.volt;
    amps1 = incomingReadings.amps;
    read_id1 = incomingReadings.readingId;
    dt1 = get_timestamp();
    jsonString1 = JSON.stringify(board);
  }
  if(prev_read_id1 != read_id1){
    prev_read_id1 = read_id1;
  }

  if(incomingReadings.id == "ESP32C3-2"){
    temp2 = incomingReadings.temp;
    humi2 = incomingReadings.humi;
    moist2 = incomingReadings.mois;
    rain2 = incomingReadings.rain;
    volt2 = incomingReadings.volt;
    amps2 = incomingReadings.amps;
    read_id2 = incomingReadings.readingId;
    dt2 = get_timestamp();
    jsonString2 = JSON.stringify(board);
  }
  if(prev_read_id2 != read_id2){
    prev_read_id2 = read_id2;
  } 

  if(incomingReadings.id == "ESP32C3-3"){
    temp3 = incomingReadings.temp;
    humi3 = incomingReadings.humi;
    moist3 = incomingReadings.mois;
    rain3 = incomingReadings.rain;
    volt3 = incomingReadings.volt;
    amps3 = incomingReadings.amps;
    read_id3 = incomingReadings.readingId;
    dt3 = get_timestamp();
    jsonString3 = JSON.stringify(board);
  }
  if(prev_read_id3 != read_id3){
    prev_read_id3 = read_id3;
  }

  if(incomingReadings.id == "ESP32C3-4"){
    temp4 = incomingReadings.temp;
    humi4 = incomingReadings.humi;
    moist4 = incomingReadings.mois;
    rain4 = incomingReadings.rain;
    volt4 = incomingReadings.volt;
    amps4 = incomingReadings.amps;
    read_id4 = incomingReadings.readingId;
    dt4 = get_timestamp();
    jsonString4 = JSON.stringify(board);
  }
  if(prev_read_id4 != read_id4){
    prev_read_id4 = read_id4;
  }

  if(incomingReadings.id == "ESP32C3-6"){
    temp6 = incomingReadings.temp;
    humi6 = incomingReadings.humi;
    moist6 = incomingReadings.mois;
    rain6 = incomingReadings.rain;
    volt6 = incomingReadings.volt;
    amps6 = incomingReadings.amps;
    read_id6 = incomingReadings.readingId;
    dt6 = get_timestamp();
    jsonString6 = JSON.stringify(board);
  }
  if(prev_read_id6 != read_id6){
    prev_read_id6 = read_id6;
  }

