rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
  if(incomingReadings.id == "ESP32C3-7"){
    temp7 = incomingReadings.temp;
    humi7 = incomingReadings.humi;
    moist7 = incomingReadings.mois;
    rain7 = incomingReadings.rain;
    volt7 = incomingReadings.volt;
    amps7 = incomingReadings.amps;
    read_id7 = incomingReadings.readingId;
    dt7 = get_timestamp();
    jsonString7 = JSON.stringify(board);
  }

  if(prev_read_id7 != read_id7){
    prev_read_id7 = read_id7;
  }

  if(incomingReadings.id == "ESP32C3-8"){
    temp8 = incomingReadings.temp;
    humi8 = incomingReadings.humi;
    moist8 = incomingReadings.mois;
    rain8 = incomingReadings.rain;
    volt8 = incomingReadings.volt;
    amps8 = incomingReadings.amps;
    read_id8 = incomingReadings.readingId;
    dt8 = get_timestamp();
    jsonString8 = JSON.stringify(board);
  }

  if(prev_read_id8 != read_id8){
    prev_read_id8 = read_id8;
  }

  Serial.printf("\nt:%.2f h:%.2f m:%.2f r:%.2f id:%d\n", temp3,humi3,moist3,rain3,read_id3);
  Serial.printf("Volt[3]:%.2f Amps[3]:%.2f \n", volt3, amps3);
  Serial.println(dt3);
  Serial.println(jsonString3);

  Serial.printf("\nt:%.2f h:%.2f m:%.2f r:%.2f id:%d\n", temp4,humi4,moist4,rain4,read_id4);
  Serial.printf("Volt[4]:%.2f Amps[4]:%.2f \n", volt4, amps4);
  Serial.println(dt4);
  Serial.println(jsonString4);

  Serial.printf("\nt:%.2f h:%.2f m:%.2f r:%.2f id:%d\n", temp6,humi6,moist6,rain6,read_id6);
  Serial.println(dt6);
  Serial.printf("Volt[6]:%.2f Amps[6]:%.2f \n", volt6, amps6);
  Serial.println(jsonString6);

  Serial.printf("\nt:%.2f h:%.2f m:%.2f r:%.2f id:%d\n", temp7,humi7,moist7,rain7,read_id7);
  Serial.println(dt7);
  Serial.printf("Volt[7]:%.2f Amps[7]:%.2f \n", volt7, amps7);
  Serial.println(jsonString7);

  Serial.printf("\nt:%.2f h:%.2f m:%.2f r:%.2f id:%d\n", temp8,humi8,moist8,rain8,read_id8);
  Serial.println(dt8);
  Serial.printf("Volt[8]:%.2f Amps[8]:%.2f \n", volt8, amps8);
  Serial.println(jsonString8);

}


void ESPNOW_HandlerTask(void * pvParameters) 
{
  Serial.print("ESPNOW_HandlerTask running on core ");
  Serial.println(xPortGetCoreID());
  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("Error initializing ESP-NOW");
    return;
  }
  esp_now_initialized = true; // this will allow the BlynkWrite to send out signal via espnow protocol
  
  // Once ESPNow is successfully Init, we will register for recv callback to
  // get recv packer info (this can be used on server and client simultaneously 25.03.2022)
  esp_now_register_recv_cb(OnDataRecv);

  // coming from client-side code start ----------------------------------------------------------
  esp_now_register_send_cb(OnDataSent);

  // Register peer (peer here is going to be client-1) CLIENT ID 1
  esp_now_peer_info_t peerInfo;
  memset(&peerInfo, 0, sizeof(peerInfo)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo.peer_addr, client1_mac, 6);
  peerInfo.encrypt = false;
  
  // Add peer CLIENT ID 1      
  if (esp_now_add_peer(&peerInfo) != ESP_OK){
    Serial.println("Failed to add peer client ID 1");
    return;
  }

  // Register peer (peer here is going to be client-2) CLIENT ID 2
  esp_now_peer_info_t peerInfo2;
  memset(&peerInfo2, 0, sizeof(peerInfo2)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo2.peer_addr, client2_mac, 6);
  peerInfo2.encrypt = false;
  
  // Add peer CLIENT ID 2       
  if (esp_now_add_peer(&peerInfo2) != ESP_OK){
    Serial.println("Failed to add peer client ID 2");
    return;
  }

    // Register peer (peer here is going to be client-3) CLIENT ID 3
  esp_now_peer_info_t peerInfo3;
  memset(&peerInfo3, 0, sizeof(peerInfo3)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo3.peer_addr, client3_mac, 6);
  peerInfo3.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo3) != ESP_OK){
    Serial.println("Failed to add peer client ID 3");
    return;
  }

  // Register peer (peer here is going to be client-4) CLIENT ID 4
  esp_now_peer_info_t peerInfo4;
  memset(&peerInfo4, 0, sizeof(peerInfo4)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo4.peer_addr, client4_mac, 6);
  peerInfo4.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo4) != ESP_OK){
    Serial.println("Failed to add peer client ID 4 (ESP32C3-4)");
    return;
  }

    // Register peer (peer here is going to be client-4) CLIENT ID 4
  esp_now_peer_info_t peerInfo6;
  memset(&peerInfo6, 0, sizeof(peerInfo6)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo6.peer_addr, client6_mac, 6);
  peerInfo6.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo6) != ESP_OK){
    Serial.println("Failed to add peer client ID 6 (ESP32C3-6)");
    return;
  }

  // Register peer (peer here is going to be client-8) CLIENT ID 8
  esp_now_peer_info_t peerInfo8;
  memset(&peerInfo8, 0, sizeof(peerInfo8)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo8.peer_addr, client8_mac, 6);
  peerInfo8.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo8) != ESP_OK){
    Serial.println("Failed to add peer client ID 8 (ESP32C3-8)");
    return;
  }

  // esp_now_peer_num_t 
  // coming from client-side code end ----------------------------------------------------------

  // leave this empty to reserve more CPU resources for other intensive tasks    
  for(;;){} // empty forever loop (no need to do anything inside here otherwise it will cost some CPU time)
} // end of FreeRTOS handler
void BLYNK_HandlerTask(void * pvParameters) 
{

  timer.setInterval(1000L, BLYNK_TASK);
  // timer.setInterval(1000L, get_weather);

  Serial.print("BLYNK_HandlerTask running on core ");
  Serial.println(xPortGetCoreID());
  for(;;){    
    Blynk.run();
    timer.run();
  }
} // end of FreeRTOS handler


void try_wifi_connect(int timeout){
    wifiRetryCount++;
    write16bitIntoEEPROM(wifiConnRetryAddress, wifiRetryCount);

