rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
    int init_index_right = 9; // init 8 + 1 offset
    int init_index_left = 6; // init 7 - 1 offset
    int column_index_right = init_index_right; 
    int column_index_left = init_index_left;

    int wl_count = 0;
    int connect_elapse = timeout; // timeout in second unit 

    Serial.printf("\n\nConnecting to %s\n\n", ssidstr);
    if(strcmp(pass,"")==0){
      Serial.println("This is an open network!");
      openNetwork = true;
    }else{
      Serial.println("This is a close network!");
      openNetwork = false;
    }
    WiFi.begin(ssid, pass); // normal connect method
    lcd.setCursor(0, 0); // row 1, column 0
    lcd.print("Conn Retry:" +String(wifiRetryCount));  
    while (WiFi.status() != WL_CONNECTED) {
          tick++;
          Serial.printf("/");
          lcd.setCursor(column_index_right, 1);
          lcd.write(1);
          column_index_right++;

          lcd.setCursor(init_index_left+1, 1);
          lcd.print("T");
          lcd.setCursor(init_index_left+2, 1);
          lcd.print(String(wl_count/10));

          lcd.setCursor(column_index_left, 1);
          lcd.write(2);
          column_index_left--;

          if(column_index_right>16 && column_index_left<0) {
            #ifdef USE_RGB_LED
              #ifndef AASAS_TPLINK
              rgbOff();
              #endif
            #endif
            column_index_right  = init_index_right; 
            column_index_left   = init_index_left;
            lcd.clear();
            if(millis()/1000 % 2 == 0){
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print("Conn Retry:" +String(wifiRetryCount));  
                lcd.setCursor(0, 1); // row 1, column 0
                lcd.print(ssidstr); // default_hostname
                delay(1000);
                off_onboard_led();

            }
            else if(millis()/1000 % 3 == 0 || millis()/1000 % 5 == 0){
                lcd.clear();
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print("Connecting WiFi");
                lcd.setCursor(0, 1); // row 1, column 0
                if(openNetwork) lcd.print("    Open Network");  
                else            lcd.print("   Close Network");  
                delay(1000);
            }
            else{
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print(ssidstr);
                on_onboard_led();
            }
          }

      wl_count++;
      delay(100);
      // vTaskDelay(100 / portTICK_PERIOD_MS);
      
      if(wl_count > connect_elapse*10 && (WiFi.status() != WL_CONNECTED)){
          Serial.println("\n\n [ESP32_AASAS_UiTM_WiFi_IoT] Cant join network within timeout. Restarting...");
          wl_count = 0;
          lcd.clear();
          lcd.setCursor(0, 0); // row 1, column 0
          lcd.print("Not Connected!");
          lcd.setCursor(0, 1); // row 1, column 0
          lcd.print("Restarting ESP32");
          delay(1000);
          ESP.restart();
      }
    }

    if(WiFi.status() == WL_CONNECTED){
      Serial.println("WiFi Connected!");
      delay(2000);
      Serial.println("Syncing RTC via NTP now...");
      delay(2000);
      timeClient.begin();
      timeClient.setTimeOffset(28800);
      timeClient.update();
      sync_rtc_ntp();
      Serial.println("Syncing RTC via NTP complete. RTC is now up-to-date!");
      delay(2000);
    }
  
    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0);
      lcd.print("-WiFi Connected-");
      lcd.setCursor(0,1);
      lcd.print(ssidstr);
      delay(1000);
      // vTaskDelay(1000 / portTICK_PERIOD_MS);
    }
}

void get_rtc(){
  _clock.getTime();
  String hour = String(_clock.hour, DEC);  
  String min  = String(_clock.minute, DEC);
  String sec  = String(_clock.second, DEC);

  byte hourByte = hour.toInt();
  byte minByte  = min.toInt();
  byte secByte  = sec.toInt();

  String year = String(_clock.year+2000, DEC);
  String month = String(_clock.month, DEC);
  String day = String(_clock.dayOfMonth, DEC);

  int year_int = year.toInt();
  byte monthByte = month.toInt();
  byte dayByte = day.toInt();
  if(year_int < 2023 || year_int > 2050){
    Serial.println("Error. Date is invalid. Restarting now...");
    delay(1000);
    ESP.restart();
  }
  Serial.printf("H_byte:%d M_byte:%d S_byte:%d --- ", hourByte, minByte, secByte);
  Serial.printf("Y_int:%d Mth_byte:%d D_byte:%d\n", year_int, monthByte, dayByte);

}

void sync_rtc_ntp(){
  String formattedDate;
  String dayStamp;
  String timeStamp;
  String lastSyncRTC;

  byte setH=0,setM=0,setS=0;
  short int setYear=2023; 
  byte setMonth=1, setDay=1;

  timeClient.update();
  setH = timeClient.getHours();
  setM = timeClient.getMinutes();
  setS = timeClient.getSeconds();  
  formattedDate   = timeClient.getFormattedDate(); 
  int splitT      = formattedDate.indexOf("T");
  dayStamp        = formattedDate.substring(0, splitT); // default to 4 || 2023-04-17
  setYear         = formattedDate.substring(0,4).toInt();
  setMonth        = formattedDate.substring(5,7).toInt();
  setDay          = formattedDate.substring(8,10).toInt();

  _clock.begin();
  _clock.fillByYMD(setYear,setMonth,setDay);
  _clock.fillByHMS(setH,setM,setS);
  _clock.fillDayOfWeek(setDay);
  _clock.setTime(); // write time and date to the RTC chip
  // Serial.printf("H:%d M:%d S:%d\n", setH, setM, setS);
  // Serial.printf("Year:%d Month:%d Day:%d\n", setYear, setMonth, setDay);
  
}

String get_timestamp(){
  timeClient.update();
  // https://github.com/taranais/NTPClient.git
  formattedDate   = timeClient.getFormattedDate(); 
  int currentHour = timeClient.getHours();
  int currentMin = timeClient.getMinutes();
  int currentsec = timeClient.getSeconds();
  int splitT      = formattedDate.indexOf("T");
  dayStamp        = formattedDate.substring(5, splitT);
  String dateTime = timeClient.getFormattedTime() + " " + dayStamp;

  bool pushAlready = false;

  if(deep_sleep_activated){
    pushAlready = false; // reset this logic
    etaHour = setSleepHour - currentHour;
    etaMin = 60 - currentMin;
    etaSec = 60 - currentsec;

    etaDS = String(etaHour)+":"+String(etaMin)+":"+String(etaSec);  
    Blynk.virtualWrite(V3, "DS starts in T-"+ etaDS);
    if((currentHour >= setSleepHour && currentMin >= setSleepMin) || (currentHour >= 0 && currentHour < 7)){
      Serial.println("Going to sleep now. Pushing Deep Sleep Timestamp of " + dateTime);
      int onlineHour = currentHour + SLEEP_HOUR - 24; // calc reconnection time
      Serial.println("Will be back online at " + String(onlineHour) + ":" + String(currentMin));
      Blynk.virtualWrite(V3, "DS started at "+ dateTime);
      Serial.flush(); 
      lcd.clear();
      lcd.setCursor(0, 0); // row 0, column 0
      lcd.print("-Back Online at:");
      lcd.setCursor(0, 1); // row 0, column 0
      String onHour, onMin;
      if(onlineHour < 10)
        onHour = "0"+String(onlineHour);
      if(currentMin < 10)
        onMin = "0"+String(currentMin);
      lcd.print(onHour+ ":" + onMin + " V:" + String(busvoltage));
      delay(1000);
      #ifdef REGULAR_I2C_LCD
        lcd.noBacklight();
      #else
        offRelay2();
      #endif
      leds.setColorRGB(i, 0, 0, 0); // turn off RGB
      delay(1000);
      esp_deep_sleep_start(); // go to sleep and wake up when timer timeout
    }
  }else{
    if(!pushAlready){
      Blynk.virtualWrite(V3, restart_ts); 
      pushAlready = true;
    }
  }
  return dateTime;
}


