rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
void off_onboard_led(){
  digitalWrite(BLINKER,0);
   #ifdef ESP32C3
      digitalWrite(ONBOARD_LED, LOW); // LOW    = OFF LED on ESP32 Dev and C3
   #else
      digitalWrite(ONBOARD_LED, HIGH); // HIGH  = OFF LED on ESP32S2
   #endif  
}

void on_onboard_led(){
  digitalWrite(BLINKER,1);
  #ifdef ESP32C3
    digitalWrite(ONBOARD_LED, HIGH); // HIGH  = ON LED on ESP32 Dev and C3
  #else
    digitalWrite(ONBOARD_LED, LOW); // LOW    = ON LED on ESP32S2
  #endif
}

void loopRGB(){
 
  pixels.setPixelColor(0, pixels.Color(127, 0, 0));
  pixels.show();   
  delay(DELAYVAL); 
  pixels.setPixelColor(0, pixels.Color(0, 127, 0));
  pixels.show();   
  delay(DELAYVAL); 
  pixels.setPixelColor(0, pixels.Color(0, 0, 127));
  pixels.show();   
  delay(DELAYVAL); 
  pixels.setPixelColor(0, pixels.Color(0, 0, 0));
  pixels.show();   
  delay(DELAYVAL); 
  pixels.setPixelColor(0, pixels.Color(0, 0, 0));
  pixels.show();   
  delay(DELAYVAL); 
}

void onRelay1(){
  digitalWrite(IN1,1);
  digitalWrite(LED_BLUE,1);
}
void offRelay1(){
  digitalWrite(IN1,0);
  digitalWrite(LED_BLUE,0);
}
void onRelay2(){
  digitalWrite(IN2,1);
  #ifdef REGULAR_I2C_LCD
    lcd.backlight();
  #endif
}
void offRelay2(){
  digitalWrite(IN2,0);
  #ifdef REGULAR_I2C_LCD
    lcd.noBacklight();
  #endif
}
void onRelay3(){
  digitalWrite(IN3,1);
}
void offRelay3(){
  digitalWrite(IN3,0);
}


void setRGB_from_RSSI(int rssi){

  /*
  good segment
  if(rssi > -30) out = "Perfect signal";  // 0 -> -30
  else if(rssi > -50) out = "Excellent signal"; -30 -> -50
  
  average segment
  else if(rssi > -60) out = "Good reliable signal"; -50 -> -60
  else if(rssi > -67) out = "Voice and Non-HD vid"; -60 -> -67
  else if(rssi > -70) out = "Light browsing and email"; -67 -> -70

  bad segment
  else if(rssi > -80) out = "Unstable connection"; -70 -> -80
  else                out = "Unlikely connection"; -80 -> -120

  */
  if(rssi < -70){
    red = map(rssi,-120,-69,255,128); // towards red
    // green = map(red,128,255,128,0); // change according to red for transition 
    green = 0;   
    blue = 0; // stay off
  }
  else if(rssi >= -70 && rssi < -50){
    green = 255; // towards green    
  }
  else{
    red = 0; // stay off
    blue = map(rssi,-50,0,128,255); // towards blue
    green = map(blue,128,255,128,0); // change according to blue for transition    
  }
    
}

void mapRGBtoRSSI(byte r, byte g, byte b){
  #ifndef ESP32C3
    pixels.setPixelColor(0, pixels.Color(r, g, b));
    pixels.show(); 
  #endif
}

void redOn(){
  #ifdef ESP32C3
  digitalWrite(R,1);
  digitalWrite(G,0);
  digitalWrite(B,0);
  #else
  pixels.setPixelColor(0, pixels.Color(127, 0, 0));
  pixels.show(); 
  #endif  
}
void greenOn(){
  #ifdef ESP32C3
  digitalWrite(R,0);
  digitalWrite(G,1);
  digitalWrite(B,0);
  #else
  pixels.setPixelColor(0, pixels.Color(0, 127, 0));
  pixels.show(); 
  #endif    
}
void blueOn(){
  #ifdef ESP32C3
  digitalWrite(R,0);
  digitalWrite(G,0);
  digitalWrite(B,1);
  #else
  pixels.setPixelColor(0, pixels.Color(0, 0, 127));
  pixels.show(); 
  #endif    
}

void rgbOff(){
  #ifdef ESP32C3
  digitalWrite(R,0);
  digitalWrite(G,0);
  digitalWrite(B,0);
  #else
  pixels.setPixelColor(0, pixels.Color(0, 0, 0));
  pixels.show(); 
  #endif   
  }

void write16bitIntoEEPROM(int address, int number)
{ 
  EEPROM.write(address, number >> 8);
  EEPROM.write(address + 1, number & 0xFF);
  EEPROM.commit();
  delay(5);
}

int read16bitFromEEPROM(int address)
{
  return (EEPROM.read(address) << 8) + EEPROM.read(address + 1);
}

void writeStringToEEPROM(int addrOffset, const String &strToWrite)
{
  byte len = strToWrite.length();
  EEPROM.write(addrOffset, len);

  for (int i = 0; i < len; i++)
  {
    EEPROM.write(addrOffset + 1 + i, strToWrite[i]);
  }
  EEPROM.commit();
  delay(5);

}

String readStringFromEEPROM(int addrOffset)
{
  int newStrLen = EEPROM.read(addrOffset);
  char data[newStrLen + 1];

  for (int i = 0; i < newStrLen; i++)
  {
    data[i] = EEPROM.read(addrOffset + 1 + i);
  }
  data[newStrLen] = '\0'; // !!! NOTE !!! Remove the space between the slash "\" and "0" (I've added a space because otherwise there is a display bug)

  return String(data);
}

void clear_wifiRetryCounter(){
  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0);
      lcd.print("Reset WiFi Retry!");
      lcd.setCursor(0,1);
      lcd.print("Retry Count Reset");
    }
    Serial.println("@@@@@@@@@@@@@@@@@@ CLEARING WiFi Retry Counter @@@@@@@@@@@@@@@@@@ ");
    write16bitIntoEEPROM(wifiConnRetryAddress,0);
}

void clear_disconnCounter(){
    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0);
      lcd.print("-Reset Disconn!-");
      lcd.setCursor(0,1);
      lcd.print("-Restarting Now-");
    }
    Serial.println("@@@@@@@@@@@@@@@@@@ CLEARING Disconnection Counter @@@@@@@@@@@@@@@@@@ ");
    disconnection_count = 0; // reset the global value here 17 Feb Friday
    write16bitIntoEEPROM(disconnCounterAddress,disconnection_count);

    Blynk.virtualWrite(V15, "Cleared DC Counter");
    Blynk.virtualWrite(V16, 0); // disconnection counter reset to zero
    // EEPROM.write(restartCounterAddress, 255);

}

 void clear_restartCounter(){
    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0);
      lcd.print("-Reset ESP32S2!-");
      lcd.setCursor(0,1);
      lcd.print("-Restarting Now-");
    }
    Serial.println("@@@@@@@@@@@@@@@@@@ CLEARING Reset Counter @@@@@@@@@@@@@@@@@@ ");
    write16bitIntoEEPROM(restartCounterAddress,0);
    // EEPROM.write(restartCounterAddress, 255);
    ESP.restart();
 
}

void check_restart_count(){
  if(restartCounter == 0){
      Serial.println("[INFO] New deployment node. Restart count is NULL");
      restartCounter += 1; // initial increment [compulsory]
      Serial.printf("[INFO] Initial restart count is ONE = %d\n", restartCounter);
      write16bitIntoEEPROM(restartCounterAddress,restartCounter);
  }
  else{
      Serial.println("[INFO] Normal reboot or restart");
      restartCounter += 1;  // increment rst count by 1 for each reboot
      Serial.printf("[INFO] the current restart count is %d\n", restartCounter);
      write16bitIntoEEPROM(restartCounterAddress,restartCounter);
  }
}

void init_eeprom(){

  if (!EEPROM.begin(EEPROM_SIZE))
  {
    Serial.println("failed to initialise EEPROM"); delay(1000000);
  }

  // Serial.println(" bytes read from Flash:");
  // for (int i = 0; i < EEPROM_SIZE; i++)
  // {
  //   if(i >= 21){
  //     Serial.print("Disconnected Timestamp String Memory "); Serial.print(i);   Serial.print(":");
  //   }
  //   // else if(i== 12 || i==13){
  //   //     Serial.print("WiFi Retry Count Memory "); Serial.print(i);   Serial.print(":");
  //   // }
  //   // else if(i== 15 || i==16){
  //   //     Serial.print("Restart Count Memory "); Serial.print(i);   Serial.print(":");
  //   // }else if (i== 18 || i==19){
  //   //     Serial.print("Disconnection Count Memory "); Serial.print(i);   Serial.print(":");
  //   // }else{
  //   //     Serial.print("R "); Serial.print(i);   Serial.print(":");
  //   // }
  //   Serial.print(byte(EEPROM.read(i))); Serial.println();
  // }
  Serial.println();
}

void initINA219(){
  if (! ina219_A.begin()) {
    Serial.println("Failed to find INA219_A chip");
    lcd.setCursor(0, 0); // row 1, column 0
    lcd.print("INA219_A FAILED!");
    lcd.setCursor(0, 1); // row 1, column 0
    lcd.print("CHECK I2C WIRE");
    while (1) { delay(10); }
  }
  ina219_A.setCalibration_32V_2A();
}

void getINA219(){
  shuntvoltage = ina219_A.getShuntVoltage_mV(); // measured across Vin+ & Vin-
  busvoltage = ina219_A.getBusVoltage_V(); // measured at Vin+ only
  current_mA = ina219_A.getCurrent_mA();
}

