rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
void BLYNK_TASK(){
    tick++; // to replace tick
    getINA219();
    if(ADS1115_AVAILABLE) 
      read_ads1115(); //   Blynk.virtualWrite(V18, ads_readout) happening inside func
    else{
      // Blynk.virtualWrite(V18, "ADS1115 Not Connected"); // before adding sonar SR04-M2
        Blynk.virtualWrite(V18, "Water Level = " + String(get_water_level_cm())+" cm @ " + String(waterLvlPercent)+"%");      
      /*
      C3-3 to AASAS M10 (TBS)
      C3-4 to AASAS M03 (MKE)
      C3-8 to AASAS M10 (TBS)
      */
    }
    if(tick % 3 == 0){
      on_onboard_led();
      if(busvoltage >= 13)
        setRGBtoWhite();
      else if(busvoltage >= 12 && busvoltage < 13)
        setRGBtoBlue();
      else if(busvoltage >= 11 && busvoltage < 12)
        setRGBtoGreen();
      else
        setRGBtoRed();
    }
    else{
      off_onboard_led();    
    }
    String dateTime = get_timestamp();
    // Serial.print("Datetime:");
    // Serial.println(dateTime);
    int RSSI_dBm =  WiFi.RSSI();
    setRGB_from_RSSI(RSSI_dBm);
    if(millis() % 2 == 0)
      mapRGBtoRSSI(red, green, blue);
    else
      rgbOff();
    
    Blynk.virtualWrite(V0,uptime_formatter::getUptime());
    Blynk.virtualWrite(V1, dateTime);
    Blynk.virtualWrite(V4, RSSI_dBm);
    Blynk.virtualWrite(V6, busvoltage);
    Blynk.virtualWrite(V7, current_mA); 
    Blynk.virtualWrite(V9, get_rssi_state(RSSI_dBm));
    Blynk.virtualWrite(V10, tempC);
    Blynk.virtualWrite(V11, humid);
    // Blynk.virtualWrite(V12, jsonWeather); // disabled temporarily
    #ifdef ESP32DEV_5
      Blynk.virtualWrite(V12, "C3-8 = " + jsonString8); // this should be C8 at TBS (need to commit DEV_5 as well for the change)
      Blynk.virtualWrite(V15, "C3-6 = " + jsonString6); // taking over disconnected ts
    #elif defined ESP32S2_3
      Blynk.virtualWrite(V12, "C3-4 = " + jsonString4); // 
      Blynk.virtualWrite(V15, "C3-7 = " + jsonString7); //
    #else
    #endif    
    Blynk.virtualWrite(V34, get_ambient_temp()); // gonna change this to V30 - 21/6/2023

    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE)
      lcd.clear();

    if(displayESPNOW){
        if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
          #if defined LOCATION_MKE2_MaxisONE || defined (LOCATION_MKE2_UiTM_WiFi_IoT)
            lcd.setCursor(0,0); // MKE2 
            lcd.print("C3-4 #"+String(read_id4)+" V:" + String(volt4)); // print connected SSID
            lcd.setCursor(0,1);
            lcd.print("C3-7 #"+String(read_id7)+" V:" + String(volt7)); // print connected SSID
          #else
            lcd.setCursor(0,0); // TBS
            lcd.print("C3-6 #"+String(read_id6)+" V:" + String(volt6)); // print connected SSID
            lcd.setCursor(0,1); // MKE2
            lcd.print("C3-8 #"+String(read_id8)+" V:" + String(volt8)); // print connected SSID
          #endif
        }
    }
    else if(deep_sleep_activated){
      if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
        lcd.setCursor(0,0); // row 0, column 0
        lcd.print("DS ETA: "+ etaDS); // print connected SSID
        lcd.setCursor(0,1); // row 0, column 0
        lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
      }
    }
    else{
       if(millis() % 2 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("----"+ String(BLYNK_DEVICE_NAME)+"---"); // ----AASAS ONE---
            lcd.setCursor(0,1);
            lcd.print(dateTime);
          }
        }
        else if(millis() % 4 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print(esp_model); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(mac_str); // print connected SSID
          }
        }
        else if(millis() % 6 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("RSSI: "+String(RSSI_dBm)+" dBm"); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(get_rssi_state(RSSI_dBm)); // print connected SSID
          }
        }
        else if(millis() % 8 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("DS ETA: "+ etaDS); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
          }
        }
        else{
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            display_uptime_top_row();
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
          }
        }    
    } // close else for espnow display
    rgb_LED_Off();      
}

BLYNK_CONNECTED() {
  blueOn();
  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0); // row 0, column 0
    lcd.print("Blynk Connected!"); // print connected SSID
    lcd.setCursor(0,1); // row 0, column 0
    lcd.print("Device is Online"); // print connected SSID
    delay(1000);
  }
  Blynk.virtualWrite(V19, wifiRetryCount);
  wifiRetryCount = 0; // reset this back for the next cycle
  write16bitIntoEEPROM(wifiConnRetryAddress, wifiRetryCount);
  String blynk_on_connected_ts = get_timestamp();
  Blynk.syncVirtual(V20,V21,V22,V23,V24,V25,V26);
  Blynk.virtualWrite(V2, WiFi.localIP().toString());
  Blynk.virtualWrite(V3, restart_ts); 
  Blynk.virtualWrite(V5, restartCounter);
  Blynk.virtualWrite(V8, ssid);
  String disconn_ts_str = readStringFromEEPROM(disconnectTS__Address);
  Serial.print("The disconnection timestamp from EEPROM: ");
  Serial.println(disconn_ts_str);
  if(disconnection_count == 0)
    Blynk.virtualWrite(V15, "Not yet");
  else
    Blynk.virtualWrite(V15, disconn_ts_str);
  disconnection_count = read16bitFromEEPROM(disconnCounterAddress);
  Blynk.virtualWrite(V16, disconnection_count);
  Blynk.virtualWrite(V17, blynk_on_connected_ts); 
  Blynk.virtualWrite(V29, default_hostname); 
}

BLYNK_DISCONNECTED() {
    redOn();
    disconnection_count++;
    write16bitIntoEEPROM(disconnCounterAddress,disconnection_count);
    disconnected_ts = get_timestamp();
    writeStringToEEPROM(disconnectTS__Address, disconnected_ts);
  
