rtxsc/esp-workspace/ESP32_AASAS_UiTM_WiFi_IoT/ESP32_AASAS_UiTM_WiFi_IoT.ino
    Serial.println("[ESP32_AASAS_UiTM_WiFi_IoT] Blynk Disconnected");
    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0); // row 0, column 0
      lcd.print("Blynk Disconnected"); // print connected SSID
      lcd.setCursor(0,1); // row 0, column 0
      lcd.print("WiFi is Down"); // print connected SSID
      delay(1000);
      lcd.clear();
      lcd.setCursor(0,0); // row 0, column 0
      lcd.print("Reinit Blynk"); // print connected SSID
      lcd.setCursor(0,1); // row 0, column 0
      lcd.print("> Blynk.begin()"); // print connected SSID
      delay(1000);
    }
    Blynk.begin(auth, ssid, pass); // must have logic to restart handshake with Blynk 10 Feb 2023
}

BLYNK_RESTART(){
  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0); // row 0, column 0
    lcd.print("-Blynk Restart!-"); // print connected SSID
    lcd.setCursor(0,1); // row 0, column 0
    lcd.print("-Force Restart!-"); // print connected SSID
    delay(1000);
  }
  disconnection_count = 0; // reset the global value here 17 Feb Friday
  // this is essential so that at every restart cycle disconnection counter will revert to zero
  // this means disconnection counter will only be incremented when the device has not gone into cold restart
  // disconnection counter will be incremented during current restart session only via BLYNK_DISCONNECTED and BLYNK_CONNECTED
  write16bitIntoEEPROM(disconnCounterAddress,disconnection_count);
}

BLYNK_ELAPSE_OUT(char state, int val){
/*
 state:
 c = connect wifi
 r = reconnect wifi
 w = wait to restart
*/
  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0); // row 0, column 0
    if(state == 'c') 
      lcd.print("[B]Connect WiFi"); // print connected SSID
    else if(state == 'r')
      lcd.print("[B]Reconnecting"); // print connected SSID
    else
      lcd.print("[B]Restart in...");
    lcd.setCursor(0,1); // row 0, column 0
    lcd.print("[B]Elapse: "+String(val)+" s"); // print connected SSID
  }
  // Serial.println("[ESP32_AASAS_UiTM_WiFi_IoT] Elapse out here");
  // Serial.println(val);
}

BLYNK_WRITE(V20){
  int pinValue = param.asInt();
  if(pinValue) redOn();
  else rgbOff();
}

BLYNK_WRITE(V21){
  int pinValue = param.asInt();
  if(pinValue) greenOn();
  else rgbOff();
}

BLYNK_WRITE(V22){
  int pinValue = param.asInt();
  if(pinValue) blueOn();
  else rgbOff();
}

BLYNK_WRITE(V23){
  int pinValue = param.asInt();
  if(pinValue) clear_restartCounter();
}

BLYNK_WRITE(V24){
  int val = param.asInt();
  if(val) onRelay1();
  else    offRelay1();
}

// borrow V25 for LED backlight on/off 
BLYNK_WRITE(V25){
  int val = param.asInt();
  if(val) onRelay2();
  else    offRelay2();
}
// borrow V26 for esp_deep_sleep function
BLYNK_WRITE(V26){
  int val = param.asInt();
  if(val) onRelay3();
  else    offRelay3();

  if(val)       deep_sleep_activated = true;
  else          deep_sleep_activated = false;
}

BLYNK_WRITE(V27){
  int pinValue = param.asInt();
  if(pinValue) clear_disconnCounter();
}

BLYNK_WRITE(V28){
  int pinValue = param.asInt();
  if(pinValue) clear_wifiRetryCounter();
  if(pinValue) displayESPNOW = true;
  else         displayESPNOW = false;
}


void cycleRGB(){
  setRGBtoRed();
  vTaskDelay(250 / portTICK_PERIOD_MS);
  setRGBtoGreen();  
  vTaskDelay(250 / portTICK_PERIOD_MS);
  setRGBtoBlue(); 
  vTaskDelay(250 / portTICK_PERIOD_MS);
}
void rgb_LED_Off(){
  leds.setColorRGB(i, 0, 0, 0);
}
void setRGBtoWhite(){
  leds.setColorRGB(i, 255, 255, 255);
}

void setRGBtoRed(){
  leds.setColorRGB(i, 255, 0, 0);
}

void setRGBtoGreen(){
  leds.setColorRGB(i, 0, 255, 0);
}

void setRGBtoBlue(){
  leds.setColorRGB(i, 0, 0, 255);
}

void mapRGBtoPH(byte r, byte g, byte b){
  leds.setColorRGB(i, r, g, b);
}

float get_water_level_cm() {
  // Set up the signal
  digitalWrite(trig_pin, LOW);
  delayMicroseconds(2);
 // Create a 10 µs impulse
  digitalWrite(trig_pin, HIGH);
  delayMicroseconds(TRIG_PULSE_DURATION_US);
  digitalWrite(trig_pin, LOW);

  // Return the wave propagation time (in µs)
  ultrason_duration = pulseIn(echo_pin, HIGH);

  //distance calculation
  distance_cm = ultrason_duration * SOUND_SPEED/2 * 0.0001;
  if(distance_cm < 40) distance_cm = 40;
  if(distance_cm > 90) distance_cm = 90;  
  waterLvlPercent = map(distance_cm,90,40,0,100);  

  // We print the distance on the serial port
  // Serial.print("Distance (cm): ");
  // Serial.println(distance_cm);
  return distance_cm;
}


void print_wakeup_reason(){
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch(wakeup_reason)
  {
    case ESP_SLEEP_WAKEUP_EXT0 : Serial.println("Wakeup caused by external signal using RTC_IO"); break;
    case ESP_SLEEP_WAKEUP_EXT1 : Serial.println("Wakeup caused by external signal using RTC_CNTL"); break;
    case ESP_SLEEP_WAKEUP_TIMER : Serial.println("Wakeup caused by timer"); break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD : Serial.println("Wakeup caused by touchpad"); break;
    case ESP_SLEEP_WAKEUP_ULP : Serial.println("Wakeup caused by ULP program"); break;
    default : Serial.printf("Wakeup was not caused by deep sleep: %d\n",wakeup_reason); break;
  }
}

